//odinms_MS
load("nashorn:mozilla_compat.js");
importPackage(net.sf.odinms.tools);
importPackage(net.sf.odinms.client);

var status = 0;

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 0 && status == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
			
			cm.sendSimple("\t\t\t\t\t#e#r流浪商人#b系列#n\r\n#d====================================================\r\n#d目前账户剩余金币:"+ cm.getMeso() + "\r\n====================================================\r\n#k您好，我是王牌飞行员#b小胖#k，同时我也是全属性武器兑换商人\r\n#k#r#e所有全服最好的武器都在我这！#n\r\n\r\n#L1##r#e谈谈关于飞天的梦想#b#n\r\n\r\n#L2#至尊不速之客单手剑（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L3#至尊不速之客单手斧（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L4#至尊不速之客单手钝器（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L5#至尊不速之客短剑（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L6#至尊不速之客短杖（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L7#至尊不速之客枪（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L8#至尊不速之客弓（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L9#至尊不速之客弩（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L10#至尊不速之客拳套（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L11#至尊不速之客指节（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L12#至尊不速之客短枪（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L13#至尊不速之客双手剑（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L14#至尊不速之客双手斧（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L15#至尊不速之客双手钝器（全属性500==#r800张#k#v4000313#）#b#n\r\n\r\n#L16#至尊不速之客矛（全属性500==#r800张#k#v4000313#）");			                } else if (status == 1) {
                  if (selection == 1) {
		  cm.sendOk("\t\t\t     #e#b飞上蓝天，俯瞰神州#n#d\r\n====================================================#k\r\n我从小就向往天空、向往广阔无垠的宇宙，却总是被人嘲笑，今天我真的能飞了，#r试问神州大地，谁人与我争锋?#k#d\r\n====================================================#k\r\n你是说猪猪也有这个梦想?太不可思议了，我一定要见见它！#d\r\n====================================================#k\r\n接下来我的计划就是乘着气球游遍东南亚列国，当然一定要带上猪猪啦，它会是我最好的伙伴！#k#d\r\n====================================================#k\r\n告诉你个秘密，#r百草堂附近#k貌似有很好的东东哦！如果您有好的建议和想法，请加入我们的免费单机群：940329930#d\r\n");
	          cm.dispose();
                  }else if(selection == 2){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客单手剑.");
                cm.gainItem(1302147,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客单手剑！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();
                  }
                  }else if(selection == 3){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客单手斧.");
                cm.gainItem(1312062,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客单手斧！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 4){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客单手钝器.");
                cm.gainItem(1322090,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客单手钝器！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 5){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客短剑.");
                cm.gainItem(1332125,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客短剑！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 6){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客短杖.");
                cm.gainItem(1372078,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客短杖！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 7){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客枪.");
                cm.gainItem(1432081,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客枪！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 8){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客弓.");
                cm.gainItem(1452106,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客弓！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 9){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客弩.");
                cm.gainItem(1462091,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客弩！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 10){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客拳套.");
                cm.gainItem(1472117,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客拳套！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 11){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客指节.");
                cm.gainItem(1482079,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客指节！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 12){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客短枪.");
                cm.gainItem(1492079,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客短枪！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 13){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客双手剑.");
                cm.gainItem(1402090,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客双手剑！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 14){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客双手斧.");
                cm.gainItem(1412062,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客双手斧！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 15){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客双手钝器.");
                cm.gainItem(1422063,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客双手钝器！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 16){ 	           
                if (cm.haveItem(4000313,800)){
                cm.sendOk("#r#e恭喜您获得全属性500的至尊不速之客矛.");
                cm.gainItem(1442111,500,500,500,500,500,500,500,500,200,200,200,200,8,8,0,0,0);
                cm.gainItem(4000313,-800);
                cm.喇叭(3,"厉害了word哥！！恭喜您获得了全属性500的至尊不速之客矛！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
             }
	}
    }
}
