status = -1;
var itemList = Array(
//-------耳环-------
Array(2290000,800,1,1),
			
			Array(3010044,600,1,1), //红伞椅子
			Array(3010036,600,1,1), //秋千
			Array(3010049,600,1,1), //学房子
			Array(3010110,600,1,1), //熊
			Array(3010131,600,1,1), //熊猫
			Array(1022129,600,1,1), //眼睛
			Array(3012001,600,1,1), //篝火 
			Array(3012002,600,1,1), //浴桶
			Array(3012003,600,1,1), //爱心
			Array(3010013,600,1,1), //遮阳椅
			Array(3010018,600,1,1), //椰子树
			Array(3010021,600,1,1), //暖暖桌
			Array(3010024,600,1,1), //玩具熊
			Array(3010025,600,1,1), //5周年枫叶纪念
			Array(3010026,600,1,1), //恶灵附身
			Array(3010034,600,1,1), //假期红
			Array(3010035,600,1,1), //假期蓝
			Array(3010043,600,1,1), //魔女扫把
			Array(3010051,600,1,1), //沙漠兔兔1
			Array(3010052,600,1,1), //沙漠兔兔2
			Array(3010054,600,1,1), //呼噜床
			Array(3010057,600,1,1), //血色玫瑰
			Array(3010058,600,1,1), //世界末日
			Array(3010063,600,1,1), //月亮星星
			Array(3010293,600,1,1), //恶灵椅子
			Array(3010403,600,1,1), //音乐会
			Array(3010410,600,1,1), //珍妮
			Array(3010411,600,1,1), //双鱼
			Array(3010412,600,1,1), //双塔
			Array(3010428,600,1,1), //水晶
			Array(3010437,600,1,1), //魔法书
			Array(3010438,600,1,1), //音符
			Array(3010453,600,1,1), //兔子
			Array(3010454,600,1,1), //爱心云朵
			Array(3010462,600,1,1), //天文台
                        Array(3010043,600,1,1), //魔女扫把
			Array(3010051,600,1,1), //沙漠兔兔1
			Array(3010052,600,1,1), //沙漠兔兔2
			Array(3010054,600,1,1), //呼噜床
			Array(3010057,600,1,1), //血色玫瑰
			Array(3010058,600,1,1), //世界末日
			Array(3010063,600,1,1), //月亮星星
			Array(3010068,600,1,1), //露水椅子
			Array(3010069,600,1,1), //大黄蜂
			Array(3010071,600,1,1), //神兽椅子
			Array(3010075,600,1,1), //音乐狂
			Array(3010075,600,1,1), //大熊猫
			Array(3010079,600,1,1), //肥猫
			Array(3010085,600,1,1), //鬼娃娃椅子
			Array(3010096,600,1,1), //恐龙化石
			Array(3010099,600,1,1), //北极熊椅子
			Array(3010109,600,1,1), //暖炉椅子
			Array(3010110,600,1,1), //白熊
			Array(3010129,600,1,1), //酋长宝座
			Array(3010139,600,1,1), //私密空间
			Array(3010140,600,1,1), //早日康复
			Array(3010147,600,1,1), //龙蛋椅子
			Array(3010149,600,1,1), //风扇
			Array(3010151,600,1,1), //无人岛
			Array(3010151,600,1,1), //三角张峰
			Array(3010169,600,1,1), //求领养
			Array(3010172,600,1,1), //星空椅子
			Array(3010175,600,1,1), //名画家椅子
			Array(3010193,600,1,1), //炼金瓶
			Array(3010195,600,1,1), //无价之宝
			Array(3010195,600,1,1), //泡泡浴缸
			Array(3010289,600,1,1), //老奶奶读通话
			Array(3010293,600,1,1), //恶灵椅子
			Array(3010403,600,1,1), //音乐会
			Array(3010410,600,1,1), //珍妮
			Array(3010411,600,1,1), //双鱼
			Array(3010412,600,1,1), //双塔
			Array(3010428,600,1,1), //水晶
			Array(3010437,600,1,1), //魔法书
			Array(3010438,600,1,1), //音符
			Array(3010453,600,1,1), //兔子
			Array(3010454,600,1,1), //爱心云朵
			Array(3010462,600,1,1), //天文台
			Array(3010494,600,1,1), //TV椅子
			Array(3010505,600,1,1), //看球赛
			Array(3010515,600,1,1), //奇石椅子
			Array(3010511,600,1,1), //公园
			Array(3010512,600,1,1), //半半
			Array(3010589,600,1,1), //充电
			Array(3010600,600,1,1), //福星
			Array(3010601,600,1,1), //竹篮
			Array(3010620,600,1,1), //泄愤
			Array(3010664,600,1,1), //进化
			Array(3010678,600,1,1), //还加吨
			Array(3010680,600,1,1), //公主
			Array(3010739,600,1,1), //香波
			Array(3010744,600,1,1), //积木
			Array(3010795,600,1,1), //栖息
			Array(3010806,600,1,1), //放飞
			Array(3010894,600,1,1), //咖啡
			Array(3012030,600,1,1), //公主
			Array(3012011,600,1,1), //火锅
Array(2340000, 66699, 1, 0), //祝福卷轴

//-------武器------

Array(1302049, 600, 1, 0), //光线鞭子
Array(1302063, 400, 1, 1), //燃烧的火焰刀
Array(1302080, 400, 1, 1), //七彩霓虹灯泡

Array(1302084, 600, 1, 1), //火柴
Array(1302085, 600, 1, 1), //叉子

Array(1302087, 100, 1, 1), //火炬

Array(1372017, 600, 1, 0), //领路灯
Array(1372033, 700, 1, 1), //圣贤短杖
Array(1372035, 500, 1, 1), //火灵珠短杖
Array(1372036, 500, 1, 1), //毒灵珠短杖
Array(1372037, 500, 1, 1), //冰灵珠短杖
Array(1372038, 500, 1, 1), //雷灵珠短杖
Array(1372039, 500, 1, 1), //爆炎之杖
Array(1372040, 500, 1, 1), //剧毒之杖
Array(1372041, 500, 1, 1), //寒冰之杖
Array(1372042, 500, 1, 1), //狂雷之杖
Array(01382049, 550, 1, 1), //朱雀
Array(01382050, 550, 1, 1), //玄武
Array(01382051, 550, 1, 1), //龙背刃
Array(01382052, 550, 1, 1), //龙背刃

Array(1442018, 550, 1, 1), //冻冻鱼
Array(1442039, 550, 1, 0), //冻冻鱼
Array(1382013, 200, 1, 1), //烈焰之杖
Array(1432182,200,1,1), //红色枪
Array(1402214,200,1,1), //红色双手剑
Array(1422156,200,1,1), //红色巨锤
Array(1452220,200,1,1), //红色弓
Array(1462208,200,1,1), //红色弩
Array(1472230,200,1,1), //红色拳套
Array(1332242,200,1,1), //红色切割者
Array(1382226,200,1,1), //红色长仗
Array(1492194,200,1,1), //红色短枪
Array(1482183,200,1,1), //红色拳甲
Array(1332235,200,1,1), //巨匠小妖精刀
Array(1342084,200,1,1), //
Array(1362099,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1372186,200,1,1), // 
Array(1382220,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1452214,200,1,1), //
Array(1402204,200,1,1), //
Array(2040006,999,1,0), //头盔防御必成卷
Array(2040007,999,1,0), //头盔体力必成卷
Array(2040303,999,1,0), //耳环智力必成卷
Array(2040403,999,1,0), //上衣防御必成卷
Array(2040506,999,1,0), //全身盔甲敏捷必成卷
Array(2040507,999,1,0), //全身盔甲防御必成卷
Array(2040603,999,1,0), //裤裙防御必成卷
Array(2040709,999,1,0), //鞋子敏捷必成卷
Array(1422149,200,1,1), //
Array(1322213,200,1,1), //
Array(1412144,200,1,1), //
Array(1432176,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1462202,200,1,1), //
Array(1492188,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1442232,200,1,1), //
Array(1472223,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1113055,200,1,1), //
Array(1032200,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1113178,200,1,1), //
Array(1302070,200,1,1), //布莱克武器
Array(1472205,200,1,1), //
Array(1492170,200,1,1), //
Array(1402185,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1452196,200,1,1), //
Array(1362081,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1322100,200,1,1), //
Array(1312142,200,1,1), //
Array(2040006,999,1,0), //头盔防御必成卷
Array(2040007,999,1,0), //头盔体力必成卷
Array(2040303,999,1,0), //耳环智力必成卷
Array(2040403,999,1,0), //上衣防御必成卷
Array(2040506,999,1,0), //全身盔甲敏捷必成卷
Array(2040507,999,1,0), //全身盔甲防御必成卷
Array(2040603,999,1,0), //裤裙防御必成卷
Array(2040709,999,1,0), //鞋子敏捷必成卷
Array(1332214,200,1,1), //
Array(1412126,200,1,1), //
Array(1422129,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1482159,200,1,1), //
Array(1372168,200,1,1), //
Array(1382199,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1442209,200,1,1), //
Array(1432158,200,1,1), //
Array(1402196,200,1,1), //法弗纳武器
Array(1412135,200,1,1), //
Array(1432167,200,1,1), //
Array(1442223,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1452205,200,1,1), //
Array(1462193,200,1,1), //
Array(2040006,999,1,0), //头盔防御必成卷
Array(2040007,999,1,0), //头盔体力必成卷
Array(2040303,999,1,0), //耳环智力必成卷
Array(2040403,999,1,0), //上衣防御必成卷
Array(2040506,999,1,0), //全身盔甲敏捷必成卷
Array(2040507,999,1,0), //全身盔甲防御必成卷
Array(2040603,999,1,0), //裤裙防御必成卷
Array(2040709,999,1,0), //鞋子敏捷必成卷
Array(1472214,200,1,1), //
Array(1482168,200,1,1), //
Array(1492179,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1382208,200,1,1), //
Array(1332225,200,1,1), //
Array(1402251,200,1,1), //埃苏莱布斯武器
Array(1412177,200,1,1), //
Array(1422184,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1432214,200,1,1), //
Array(1442268,200,1,1), //
Array(1452252,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1462239,200,1,1), //
Array(1472261,200,1,1), //
Array(2040006,999,1,0), //头盔防御必成卷
Array(2040007,999,1,0), //头盔体力必成卷
Array(2040303,999,1,0), //耳环智力必成卷
Array(2040403,999,1,0), //上衣防御必成卷
Array(2040506,999,1,0), //全身盔甲敏捷必成卷
Array(2040507,999,1,0), //全身盔甲防御必成卷
Array(2040603,999,1,0), //裤裙防御必成卷
Array(2040709,999,1,0), //鞋子敏捷必成卷
Array(1482216,200,1,1), //
Array(1492231,200,1,1), //
Array(1472261,200,1,1), //
Array(1382259,200,1,1), //
Array(1003798,200,1,1), //高贵专卖
Array(1042255,200,1,1), //
Array(1062166,200,1,1), //
Array(1003797,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1042254,200,1,1), //
Array(1062165,200,1,1), //
Array(1062167,200,1,1), //
Array(2040006,999,1,0), //头盔防御必成卷
Array(2040007,999,1,0), //头盔体力必成卷
Array(2040303,999,1,0), //耳环智力必成卷
Array(2040403,999,1,0), //上衣防御必成卷
Array(2040506,999,1,0), //全身盔甲敏捷必成卷
Array(2040507,999,1,0), //全身盔甲防御必成卷
Array(2040603,999,1,0), //裤裙防御必成卷
Array(2040709,999,1,0), //鞋子敏捷必成卷
Array(1042256,200,1,1), //
Array(1003799,200,1,1), //
Array(1003801,200,1,1), //
Array(1042258,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1062169,200,1,1), //
Array(1132174,200,1,1), //暴君装备
Array(1132175,200,1,1), //
Array(1132176,200,1,1), //
Array(1132177,200,1,1), //
Array(1132178,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1102481,200,1,1), //
Array(1102482,200,1,1), //
Array(1102483,200,1,1), //
Array(1102484,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1102485,200,1,1), //
Array(1082543,200,1,1), //
Array(1082544,200,1,1), //
Array(2040710,999,1,0), //鞋子跳跃必成卷
Array(2040711,999,1,0), //鞋子速度必成卷
Array(2040806,999,1,0), //手套敏捷必成卷
Array(2040903,999,1,0), //盾牌防御必成卷
Array(2041024,999,1,0), //披风魔法防御必成卷
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(1082545,200,1,1), //
Array(1082546,200,1,1), //
Array(1082547,200,1,1), //
Array(1072743,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1072744,200,1,1), //
Array(1072745,200,1,1), //
Array(1072746,200,1,1), //
Array(1072747,200,1,1), //
Array(1092109,200,1,1), //外星装备
Array(1092110,200,1,1), //
Array(1092111,200,1,1), //
Array(1122197,200,1,1), //
Array(1032142,200,1,1), //
Array(1112738,200,1,1), //
Array(2040710,999,1,0), //鞋子跳跃必成卷
Array(2040711,999,1,0), //鞋子速度必成卷
Array(2040806,999,1,0), //手套敏捷必成卷
Array(2040903,999,1,0), //盾牌防御必成卷
Array(2041024,999,1,0), //披风魔法防御必成卷
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(1132152,200,1,1), //
Array(1302224,200,1,1), //
Array(1362104,200,1,1), //
Array(1452168,200,1,1), //
Array(1312115,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1432137,200,1,1), //
Array(1442181,200,1,1), //
Array(1382167,200,1,1), //
Array(1462157,200,1,1), //
Array(2040710,999,1,0), //鞋子跳跃必成卷
Array(2040711,999,1,0), //鞋子速度必成卷
Array(2040806,999,1,0), //手套敏捷必成卷
Array(2040903,999,1,0), //盾牌防御必成卷
Array(2041024,999,1,0), //披风魔法防御必成卷
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(1472178,200,1,1), //
Array(1482139,200,1,1), //
Array(1412103,200,1,1), //
Array(1402150,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1422106,200,1,1), //
Array(1492149,200,1,1), //
Array(1082432,200,1,1), //
Array(1052460,200,1,1), //
Array(2040710,999,1,0), //鞋子跳跃必成卷
Array(2040711,999,1,0), //鞋子速度必成卷
Array(2040806,999,1,0), //手套敏捷必成卷
Array(2040903,999,1,0), //盾牌防御必成卷
Array(2041024,999,1,0), //披风魔法防御必成卷
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(1003540,200,1,1), //
Array(1072664,200,1,1), //
Array(1342070,200,1,1), //
Array(1332192,200,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1302308,20,1,1), //
Array(1302307,20,1,1), //
Array(1302310,20,1,1), //
Array(1302309,20,1,1), //
Array(2040710,999,1,0), //鞋子跳跃必成卷
Array(2040711,999,1,0), //鞋子速度必成卷
Array(2040806,999,1,0), //手套敏捷必成卷
Array(2040903,999,1,0), //盾牌防御必成卷
Array(2041024,999,1,0), //披风魔法防御必成卷
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(1302305,20,1,1), //
Array(1302258,20,1,1), //
Array(1302249,20,1,1), //
Array(1402184,20,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1402300,20,1,1), //
Array(1402304,20,1,1), //
Array(1402308,20,1,1), //
Array(1402310,20,1,1), //
Array(2040006,999,1,0), //头盔防御必成卷
Array(2040007,999,1,0), //头盔体力必成卷
Array(2040303,999,1,0), //耳环智力必成卷
Array(2040403,999,1,0), //上衣防御必成卷
Array(2040506,999,1,0), //全身盔甲敏捷必成卷
Array(2040507,999,1,0), //全身盔甲防御必成卷
Array(2040603,999,1,0), //裤裙防御必成卷
Array(2040709,999,1,0), //鞋子敏捷必成卷
Array(1402311,20,1,1), //
Array(1402317,20,1,1), //
Array(1402319,20,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1402318,20,1,1), //
Array(1402321,20,1,1), //
Array(1432150,20,1,1), //
Array(2040710,999,1,0), //鞋子跳跃必成卷
Array(2040711,999,1,0), //鞋子速度必成卷
Array(2040806,999,1,0), //手套敏捷必成卷
Array(2040903,999,1,0), //盾牌防御必成卷
Array(2041024,999,1,0), //披风魔法防御必成卷
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(1432151,20,1,1), //
Array(1432152,20,1,1), //
Array(1432153,20,1,1), //
Array(1432154,20,1,1), //
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(1432155,20,1,1), //
Array(1442139,20,1,1), //
Array(1442140,20,1,1), //





Array(2040805, 200, 1, 1), //手套攻击卷轴10%
Array(2040814, 500, 1, 0), //手套魔力诅咒卷轴70%
Array(2040815, 500, 1, 0), //手套魔力诅咒卷轴30%
Array(2040816, 500, 1, 0), //手套魔力卷轴10%
Array(2040817, 500, 1, 0), //手套魔力卷轴60%
Array(2040818, 500, 1, 0), //手套魔力卷轴100%
Array(2040006,999,1,0), //头盔防御必成卷
Array(2040007,999,1,0), //头盔体力必成卷
Array(2040303,999,1,0), //耳环智力必成卷
Array(2040403,999,1,0), //上衣防御必成卷
Array(2040506,999,1,0), //全身盔甲敏捷必成卷
Array(2040507,999,1,0), //全身盔甲防御必成卷
Array(2040603,999,1,0), //裤裙防御必成卷
Array(2040709,999,1,0), //鞋子敏捷必成卷
Array(2040710,999,1,0), //鞋子跳跃必成卷
Array(2040711,999,1,0), //鞋子速度必成卷
Array(2040806,999,1,0), //手套敏捷必成卷
Array(2040903,999,1,0), //盾牌防御必成卷
Array(2041024,999,1,0), //披风魔法防御必成卷
Array(2041025,999,1,0), //披风物理防御必成卷
Array(2043003,999,1,0), //单手剑攻击必成卷
Array(2043103,999,1,0), //单手斧攻击必成卷
Array(2043203,999,1,0), //单手钝器攻击必成卷
Array(2043303,999,1,0), //短剑攻击必成卷
Array(2043703,999,1,0), //短杖攻击必成卷
Array(2043803,999,1,0), //长杖攻击必成卷
Array(2044003,999,1,0), //双手剑攻击必成卷
Array(2044019,999,1,0), //双手剑魔力必成卷
Array(2044103,999,1,0), //双手斧攻击必成卷
Array(2044203,999,1,0), //双手钝器攻击必成卷
Array(2044303,999,1,0), //枪攻击必成卷
Array(2044403,999,1,0), //矛攻击必成卷
Array(2044603,999,1,0), //弩攻击必成卷
Array(2044503,999,1,0), //弓攻击必成卷
Array(2044703,999,1,0), //拳套攻击必成卷
Array(2044815,999,1,0), //指节攻击必成卷
Array(2044908,999,1,0), //短枪攻击必成卷


Array(2040914, 600, 1, 0), //盾牌攻击卷轴60%
Array(2040915, 600, 1, 0), //盾牌攻击卷轴10%
Array(2040916, 400, 1, 0), //盾牌攻击诅咒卷轴70%
Array(2040917, 200, 1, 0), //盾牌攻击诅咒卷轴30%
Array(2040919, 200, 1, 0), //盾牌魔力卷轴60%
Array(2040920, 600, 1, 0), //盾牌魔力卷轴10%
Array(2040921, 600, 1, 0), //盾牌魔力诅咒卷轴70%
Array(2040922, 400, 1, 0), //盾牌魔力诅咒卷轴30%
Array(1113074,200,1,1), //
Array(1032222,200,1,1), //
Array(1132245,200,1,1), //
Array(1122266,200,1,1), //

Array(1113075,200,1,1), //
Array(1032223,200,1,1), //
Array(1122267,200,1,1), //
Array(1132246,200,1,1), //

Array(2049100, 500, 1, 1), //混沌卷轴60%
Array(2340000, 500, 1, 1) //混沌卷轴60%




);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.getPlayer().getNX() > 5000) {
            cm.sendYesNo("\r\n包括#r这里是拼人品的抽奖系统只要花费5000点卷，就有机率可以抽到以下物品\r\nPS：#b枫叶可以兑换点卷#k等方式获得，下面展示#r部分抽奖样品#k！\r\n#v1402037##v01382045##v01382046##v1382047##v01382048##v1402214##v1422156##v1452220##v1462208##v1472230##v1332242##v1382226##v1492194##v1482183##v1302142##v1312056##v1332114##v1372071##v1382093##v1402085##v1442057##v1452100##v1472111##v1492073##v1432075##v1442104##v1462085##v2049100##v2340000##v2044703##v2044502##v1442018##v1302106##v1372017##v1302085##v1302080##v3010049##v3010110##v3012001##v3010013##v3010057##v3010058##v3010151##v3010494##v3010505##v3010609##v3010044##v3010026##v3010034##v03010035##v3010054##v3010075##v3010075##v3010085##v3010099##v01302308##v01302307##v01302310##v01302309##v01302305##v01302258##v01302249##v01402184##v01402300##v01402304##v01402308##v01402310##v01402311##v01402317##v01402319##v01402318##v01402321##v01412153##v01412164##v01422170##v01422185##v01432140##v01432150##v01432151##v01432152##v01432153##v01432154##v01432155##v01442139##v01442140##v01452148##v01452149##v01452232##v01452198##v01452302##v01462138##v01462219##v01462186##v01472241##v01472236##v01472207##v01382239##v01382235##v01382202##v01372201##v01372178##v01432136##v01432150##v01432152##v1132174##v1132175##v1132176##v1132177##v1132178##v1102481##v1102482##v1102483##v1102484##v1102485##v1082543##v1082544##v1082545##v1082546##v1082547##v1072743##v1072744##v1072745##v1072746##v1072747##v1402251##v1412177##v1422184##v1432214##v1442268##v1452252##v1462239##v1472261##v1482216##v1492231##v1472261##v1472261##v1003798##v1042255##v1062166##v1003797##v1042254##v1062165##v1062167##v1042256##v1003799##v1003801##v1042258##v1062169##v1402196##v1412135##v1432167##v1442223##v1452205##v1462193##v1472214##v1482168##v1492179##v1382208##v1332225##v1092109##v1092110##v1092111##v1122197##v1032142##v1112738##v1132152##v1302224##v1362104##v1452168##v1312115##v1432137##v1442181##v1382167##v1462157##v1472178##v1482139##v1412103##v1402150##v1422106##v1492149##v1082432##v1052460##v1003540##v1072664##v1342070##v1332192##v1332235##v1342084##v1362099##v1372186##v1382220##v1452214##v1402204##v1422149##v1322213##v1412144##v1432176##v1462202##v1492188##v1442232##v1472223##v1113055##v1032200##v1113178##v1132246##v1122267##v1032223##v1113075##v1122266##v1132245##v1032222##v1113074#");
        } else {
            cm.sendOk("抽一次奖需要#b5000点券#k，你背包里有足够的点券吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "寻宝活动", notice);
            if (item != -1) {
                cm.gainNX(-5000);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有足够的点券吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：红色枫叶10张。)");
            cm.gainNX(-5000);
            cm.gainItem(4001126, 10);
            cm.safeDispose();
        }
    }
}